wintersmith/contents/articles/Haskell/2015-01-11-haskell-lesson-2-Type.html
---
date: 2015-01-11 20:39:10
template: tech.jade
title: Haskell 第二课 —— 类型
category: Haskell
chage_frequency: monthly
tag: Haskell
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Type</a></li>
<li><a href="#sec-2">Type partial</a></li>
<li><a href="#sec-3">TypeClass</a></li>
<li><a href="#sec-4">newType</a></li>
<li><a href="#sec-5">Functor</a></li>
<li><a href="#sec-6">Kind</a></li>
<li><a href="#sec-7">(-&gt;) r</a></li>
<li><a href="#sec-8">Applicative</a></li>
<li><a href="#sec-9">liftA2</a></li>
<li><a href="#sec-10">Monoid</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Type</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-haskell">data Maybe a = Nothing | Just a
</pre>
</div>
<dl class="org-dl">
<dt> Maybe </dt><dd>type constructor
</dd>
<dt> Nothing </dt><dd>variable constructor
</dd>
<dt> Just a </dt><dd>variable constructor
</dd>
<dt> a </dt><dd>type varaible
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Type partial</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-haskell">type MaybeInt = Maybe Int
type EitherInt = Either Int
type EitherIntString = EitherInt String
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">TypeClass</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-haskell">class YesNo a where
     yesno :: a -&gt; Bool
</pre>
</div>

<dl class="org-dl">
<dt> YesNo </dt><dd>typeClass
</dd>
<dt> a </dt><dd>type variable
</dd>
<dt> yesno </dt><dd>typeClass function
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">newType</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-haskell">newtype CoolBool = CoolBool { getCoolBool :: Bool}
</pre>
</div>

<ul class="org-ul">
<li>定义一种已有类型的wrap或者具化
</li>
<li>haskell 不会真正创建类型，开销小
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Functor</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">

<pre class="src src-haskell">class  Functor f where 
   fmap :: (a -&gt; b) -&gt; f a -&gt; f b
</pre>
</div>

<dl class="org-dl">
<dt> f </dt><dd>type constructor
</dd>
<dt> a </dt><dd>type varaible a
</dd>
<dt> b </dt><dd>type variable b
</dd>
<dt> f a </dt><dd>type construct by : f a (eg. Maybe Int)
</dd>
<dt> f b </dt><dd>same
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Kind</h2>
<div class="outline-text-2" id="text-6">
<p>
类型有Kind，即类型本身的类型，通过使用ghci 的:k 功能，可以查阅到某个类型的Kind:
</p>
<div class="org-src-container">

<pre class="src src-haskell">:k Maybe
Maybe :: * -&gt; *
:k Int
Int :: *
:k Maybe Int
Maybe Int :: *
:k Either
Either :: * -&gt; * -&gt; *
:k Either Int
Either Int :: * -&gt; *
</pre>
</div>
<ul class="org-ul">
<li>'*' 代表一concrete（明确）的类型，只有明确的类型才能用作变量的类型，其它类型是抽象类型或者说类型的模板
</li>
<li>* -&gt; * 代表一一个类型构造器，或者说参数化的类型，它接收一个明确类型为参数，然后构造出一个明确类型
</li>
</ul>
<p>
类型的构造器如果有多个参数（Either），那么就可以curry化，即部分应用明确类型后，生成出一个新的类型构造器
</p>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">(-&gt;) r</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">

<pre class="src src-haskell">instance Functor ((-&gt;) r) where
  fmap :: (a-&gt;b) -&gt; (r -&gt; a) -&gt; (r -&gt; b)
  # fmap = .
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">Applicative</h2>
<div class="outline-text-2" id="text-8">
<p>
<b>Control.Applicative</b>
</p>
<div class="org-src-container">

<pre class="src src-haskell">class Functor f =&gt; Applicative (f :: * -&gt; *) where
  pure a = f a
  &lt;*&gt; :: f (a -&gt; b) -&gt; f a -&gt; f b 
  &lt;$&gt; :: (a -&gt; b) -&gt; f a -&gt; f b
</pre>
</div>
<div class="org-src-container">

<pre class="src src-haskell"> instance Applicative ((-&gt;) r) where 
    pure a x = \_ -&gt; x
    (f &lt;*&gt; g) x = (f x)(g x)
    f &lt;$&gt; g = f . g 
-- prove
f (a-&gt;b) = \x -&gt; \a -&gt; b = \x -&gt; \a -&gt; (h a) x -- h (a,x)
f a = \x' -&gt; a = \x' -&gt; k x'
f (a-&gt;b) &lt;*&gt; f a = \x' -&gt; \a -&gt; (h a) (k x') = \x' -&gt; (h x')(k x')
(a-&gt;b) = \x -&gt; b = h x
f a = \x' -&gt; a = g x'
(a-&gt;b) &lt;$&gt; f a = \x' -&gt; h (g x') = \x' -&gt; h . g $ x'
-- example
(+) &lt;$&gt; (*2) &lt;*&gt; (+10) 3= ((+) . (*2)) 3)(+10 3) = ((+) . (*2) $ 3)(+10 3)
			= ((+) . 6) 13 = (+6) 13 = 19
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">liftA2</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">

<pre class="src src-haskell">liftA2 :: f (a -&gt; b -&gt; c) -&gt; f a -&gt; f b -&gt; f c
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">Monoid</h2>
<div class="outline-text-2" id="text-10">
<p>
<b>Data.Monoid</b>
</p>
<div class="org-src-container">

<pre class="src src-haskell">class Monoid m where
  mempty  :: m
  mappend :: m -&gt; m -&gt; m
  mconcat :: [m] -&gt; m
  mconcat :: foldr mappend mempty
</pre>
</div>
</div>
</div>
